; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p12---int100n150-m25---int100c110---s284---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 level118 level119 level120 level121 level122 level123 level124 level125 level126 level127 level128 level129 level130 level131 level132 level133 level134 level135 level136 level137 level138 level139 level140 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level10 level10)
(sum level0 level11 level11)
(sum level0 level15 level15)
(sum level0 level16 level16)
(sum level0 level25 level25)
(sum level1 level2 level3)
(sum level1 level10 level11)
(sum level1 level11 level12)
(sum level1 level15 level16)
(sum level1 level16 level17)
(sum level1 level25 level26)
(sum level2 level2 level4)
(sum level2 level10 level12)
(sum level2 level11 level13)
(sum level2 level15 level17)
(sum level2 level16 level18)
(sum level2 level25 level27)
(sum level3 level2 level5)
(sum level3 level10 level13)
(sum level3 level11 level14)
(sum level3 level15 level18)
(sum level3 level16 level19)
(sum level3 level25 level28)
(sum level4 level2 level6)
(sum level4 level10 level14)
(sum level4 level11 level15)
(sum level4 level15 level19)
(sum level4 level16 level20)
(sum level4 level25 level29)
(sum level5 level2 level7)
(sum level5 level10 level15)
(sum level5 level11 level16)
(sum level5 level15 level20)
(sum level5 level16 level21)
(sum level5 level25 level30)
(sum level6 level2 level8)
(sum level6 level10 level16)
(sum level6 level11 level17)
(sum level6 level15 level21)
(sum level6 level16 level22)
(sum level6 level25 level31)
(sum level7 level2 level9)
(sum level7 level10 level17)
(sum level7 level11 level18)
(sum level7 level15 level22)
(sum level7 level16 level23)
(sum level7 level25 level32)
(sum level8 level2 level10)
(sum level8 level10 level18)
(sum level8 level11 level19)
(sum level8 level15 level23)
(sum level8 level16 level24)
(sum level8 level25 level33)
(sum level9 level2 level11)
(sum level9 level10 level19)
(sum level9 level11 level20)
(sum level9 level15 level24)
(sum level9 level16 level25)
(sum level9 level25 level34)
(sum level10 level2 level12)
(sum level10 level10 level20)
(sum level10 level11 level21)
(sum level10 level15 level25)
(sum level10 level16 level26)
(sum level10 level25 level35)
(sum level11 level2 level13)
(sum level11 level10 level21)
(sum level11 level11 level22)
(sum level11 level15 level26)
(sum level11 level16 level27)
(sum level11 level25 level36)
(sum level12 level2 level14)
(sum level12 level10 level22)
(sum level12 level11 level23)
(sum level12 level15 level27)
(sum level12 level16 level28)
(sum level12 level25 level37)
(sum level13 level2 level15)
(sum level13 level10 level23)
(sum level13 level11 level24)
(sum level13 level15 level28)
(sum level13 level16 level29)
(sum level13 level25 level38)
(sum level14 level2 level16)
(sum level14 level10 level24)
(sum level14 level11 level25)
(sum level14 level15 level29)
(sum level14 level16 level30)
(sum level14 level25 level39)
(sum level15 level2 level17)
(sum level15 level10 level25)
(sum level15 level11 level26)
(sum level15 level15 level30)
(sum level15 level16 level31)
(sum level15 level25 level40)
(sum level16 level2 level18)
(sum level16 level10 level26)
(sum level16 level11 level27)
(sum level16 level15 level31)
(sum level16 level16 level32)
(sum level16 level25 level41)
(sum level17 level2 level19)
(sum level17 level10 level27)
(sum level17 level11 level28)
(sum level17 level15 level32)
(sum level17 level16 level33)
(sum level17 level25 level42)
(sum level18 level2 level20)
(sum level18 level10 level28)
(sum level18 level11 level29)
(sum level18 level15 level33)
(sum level18 level16 level34)
(sum level18 level25 level43)
(sum level19 level2 level21)
(sum level19 level10 level29)
(sum level19 level11 level30)
(sum level19 level15 level34)
(sum level19 level16 level35)
(sum level19 level25 level44)
(sum level20 level2 level22)
(sum level20 level10 level30)
(sum level20 level11 level31)
(sum level20 level15 level35)
(sum level20 level16 level36)
(sum level20 level25 level45)
(sum level21 level2 level23)
(sum level21 level10 level31)
(sum level21 level11 level32)
(sum level21 level15 level36)
(sum level21 level16 level37)
(sum level21 level25 level46)
(sum level22 level2 level24)
(sum level22 level10 level32)
(sum level22 level11 level33)
(sum level22 level15 level37)
(sum level22 level16 level38)
(sum level22 level25 level47)
(sum level23 level2 level25)
(sum level23 level10 level33)
(sum level23 level11 level34)
(sum level23 level15 level38)
(sum level23 level16 level39)
(sum level23 level25 level48)
(sum level24 level2 level26)
(sum level24 level10 level34)
(sum level24 level11 level35)
(sum level24 level15 level39)
(sum level24 level16 level40)
(sum level24 level25 level49)
(sum level25 level2 level27)
(sum level25 level10 level35)
(sum level25 level11 level36)
(sum level25 level15 level40)
(sum level25 level16 level41)
(sum level25 level25 level50)
(sum level26 level2 level28)
(sum level26 level10 level36)
(sum level26 level11 level37)
(sum level26 level15 level41)
(sum level26 level16 level42)
(sum level26 level25 level51)
(sum level27 level2 level29)
(sum level27 level10 level37)
(sum level27 level11 level38)
(sum level27 level15 level42)
(sum level27 level16 level43)
(sum level27 level25 level52)
(sum level28 level2 level30)
(sum level28 level10 level38)
(sum level28 level11 level39)
(sum level28 level15 level43)
(sum level28 level16 level44)
(sum level28 level25 level53)
(sum level29 level2 level31)
(sum level29 level10 level39)
(sum level29 level11 level40)
(sum level29 level15 level44)
(sum level29 level16 level45)
(sum level29 level25 level54)
(sum level30 level2 level32)
(sum level30 level10 level40)
(sum level30 level11 level41)
(sum level30 level15 level45)
(sum level30 level16 level46)
(sum level30 level25 level55)
(sum level31 level2 level33)
(sum level31 level10 level41)
(sum level31 level11 level42)
(sum level31 level15 level46)
(sum level31 level16 level47)
(sum level31 level25 level56)
(sum level32 level2 level34)
(sum level32 level10 level42)
(sum level32 level11 level43)
(sum level32 level15 level47)
(sum level32 level16 level48)
(sum level32 level25 level57)
(sum level33 level2 level35)
(sum level33 level10 level43)
(sum level33 level11 level44)
(sum level33 level15 level48)
(sum level33 level16 level49)
(sum level33 level25 level58)
(sum level34 level2 level36)
(sum level34 level10 level44)
(sum level34 level11 level45)
(sum level34 level15 level49)
(sum level34 level16 level50)
(sum level34 level25 level59)
(sum level35 level2 level37)
(sum level35 level10 level45)
(sum level35 level11 level46)
(sum level35 level15 level50)
(sum level35 level16 level51)
(sum level35 level25 level60)
(sum level36 level2 level38)
(sum level36 level10 level46)
(sum level36 level11 level47)
(sum level36 level15 level51)
(sum level36 level16 level52)
(sum level36 level25 level61)
(sum level37 level2 level39)
(sum level37 level10 level47)
(sum level37 level11 level48)
(sum level37 level15 level52)
(sum level37 level16 level53)
(sum level37 level25 level62)
(sum level38 level2 level40)
(sum level38 level10 level48)
(sum level38 level11 level49)
(sum level38 level15 level53)
(sum level38 level16 level54)
(sum level38 level25 level63)
(sum level39 level2 level41)
(sum level39 level10 level49)
(sum level39 level11 level50)
(sum level39 level15 level54)
(sum level39 level16 level55)
(sum level39 level25 level64)
(sum level40 level2 level42)
(sum level40 level10 level50)
(sum level40 level11 level51)
(sum level40 level15 level55)
(sum level40 level16 level56)
(sum level40 level25 level65)
(sum level41 level2 level43)
(sum level41 level10 level51)
(sum level41 level11 level52)
(sum level41 level15 level56)
(sum level41 level16 level57)
(sum level41 level25 level66)
(sum level42 level2 level44)
(sum level42 level10 level52)
(sum level42 level11 level53)
(sum level42 level15 level57)
(sum level42 level16 level58)
(sum level42 level25 level67)
(sum level43 level2 level45)
(sum level43 level10 level53)
(sum level43 level11 level54)
(sum level43 level15 level58)
(sum level43 level16 level59)
(sum level43 level25 level68)
(sum level44 level2 level46)
(sum level44 level10 level54)
(sum level44 level11 level55)
(sum level44 level15 level59)
(sum level44 level16 level60)
(sum level44 level25 level69)
(sum level45 level2 level47)
(sum level45 level10 level55)
(sum level45 level11 level56)
(sum level45 level15 level60)
(sum level45 level16 level61)
(sum level45 level25 level70)
(sum level46 level2 level48)
(sum level46 level10 level56)
(sum level46 level11 level57)
(sum level46 level15 level61)
(sum level46 level16 level62)
(sum level46 level25 level71)
(sum level47 level2 level49)
(sum level47 level10 level57)
(sum level47 level11 level58)
(sum level47 level15 level62)
(sum level47 level16 level63)
(sum level47 level25 level72)
(sum level48 level2 level50)
(sum level48 level10 level58)
(sum level48 level11 level59)
(sum level48 level15 level63)
(sum level48 level16 level64)
(sum level48 level25 level73)
(sum level49 level2 level51)
(sum level49 level10 level59)
(sum level49 level11 level60)
(sum level49 level15 level64)
(sum level49 level16 level65)
(sum level49 level25 level74)
(sum level50 level2 level52)
(sum level50 level10 level60)
(sum level50 level11 level61)
(sum level50 level15 level65)
(sum level50 level16 level66)
(sum level50 level25 level75)
(sum level51 level2 level53)
(sum level51 level10 level61)
(sum level51 level11 level62)
(sum level51 level15 level66)
(sum level51 level16 level67)
(sum level51 level25 level76)
(sum level52 level2 level54)
(sum level52 level10 level62)
(sum level52 level11 level63)
(sum level52 level15 level67)
(sum level52 level16 level68)
(sum level52 level25 level77)
(sum level53 level2 level55)
(sum level53 level10 level63)
(sum level53 level11 level64)
(sum level53 level15 level68)
(sum level53 level16 level69)
(sum level53 level25 level78)
(sum level54 level2 level56)
(sum level54 level10 level64)
(sum level54 level11 level65)
(sum level54 level15 level69)
(sum level54 level16 level70)
(sum level54 level25 level79)
(sum level55 level2 level57)
(sum level55 level10 level65)
(sum level55 level11 level66)
(sum level55 level15 level70)
(sum level55 level16 level71)
(sum level55 level25 level80)
(sum level56 level2 level58)
(sum level56 level10 level66)
(sum level56 level11 level67)
(sum level56 level15 level71)
(sum level56 level16 level72)
(sum level56 level25 level81)
(sum level57 level2 level59)
(sum level57 level10 level67)
(sum level57 level11 level68)
(sum level57 level15 level72)
(sum level57 level16 level73)
(sum level57 level25 level82)
(sum level58 level2 level60)
(sum level58 level10 level68)
(sum level58 level11 level69)
(sum level58 level15 level73)
(sum level58 level16 level74)
(sum level58 level25 level83)
(sum level59 level2 level61)
(sum level59 level10 level69)
(sum level59 level11 level70)
(sum level59 level15 level74)
(sum level59 level16 level75)
(sum level59 level25 level84)
(sum level60 level2 level62)
(sum level60 level10 level70)
(sum level60 level11 level71)
(sum level60 level15 level75)
(sum level60 level16 level76)
(sum level60 level25 level85)
(sum level61 level2 level63)
(sum level61 level10 level71)
(sum level61 level11 level72)
(sum level61 level15 level76)
(sum level61 level16 level77)
(sum level61 level25 level86)
(sum level62 level2 level64)
(sum level62 level10 level72)
(sum level62 level11 level73)
(sum level62 level15 level77)
(sum level62 level16 level78)
(sum level62 level25 level87)
(sum level63 level2 level65)
(sum level63 level10 level73)
(sum level63 level11 level74)
(sum level63 level15 level78)
(sum level63 level16 level79)
(sum level63 level25 level88)
(sum level64 level2 level66)
(sum level64 level10 level74)
(sum level64 level11 level75)
(sum level64 level15 level79)
(sum level64 level16 level80)
(sum level64 level25 level89)
(sum level65 level2 level67)
(sum level65 level10 level75)
(sum level65 level11 level76)
(sum level65 level15 level80)
(sum level65 level16 level81)
(sum level65 level25 level90)
(sum level66 level2 level68)
(sum level66 level10 level76)
(sum level66 level11 level77)
(sum level66 level15 level81)
(sum level66 level16 level82)
(sum level66 level25 level91)
(sum level67 level2 level69)
(sum level67 level10 level77)
(sum level67 level11 level78)
(sum level67 level15 level82)
(sum level67 level16 level83)
(sum level67 level25 level92)
(sum level68 level2 level70)
(sum level68 level10 level78)
(sum level68 level11 level79)
(sum level68 level15 level83)
(sum level68 level16 level84)
(sum level68 level25 level93)
(sum level69 level2 level71)
(sum level69 level10 level79)
(sum level69 level11 level80)
(sum level69 level15 level84)
(sum level69 level16 level85)
(sum level69 level25 level94)
(sum level70 level2 level72)
(sum level70 level10 level80)
(sum level70 level11 level81)
(sum level70 level15 level85)
(sum level70 level16 level86)
(sum level70 level25 level95)
(sum level71 level2 level73)
(sum level71 level10 level81)
(sum level71 level11 level82)
(sum level71 level15 level86)
(sum level71 level16 level87)
(sum level71 level25 level96)
(sum level72 level2 level74)
(sum level72 level10 level82)
(sum level72 level11 level83)
(sum level72 level15 level87)
(sum level72 level16 level88)
(sum level72 level25 level97)
(sum level73 level2 level75)
(sum level73 level10 level83)
(sum level73 level11 level84)
(sum level73 level15 level88)
(sum level73 level16 level89)
(sum level73 level25 level98)
(sum level74 level2 level76)
(sum level74 level10 level84)
(sum level74 level11 level85)
(sum level74 level15 level89)
(sum level74 level16 level90)
(sum level74 level25 level99)
(sum level75 level2 level77)
(sum level75 level10 level85)
(sum level75 level11 level86)
(sum level75 level15 level90)
(sum level75 level16 level91)
(sum level75 level25 level100)
(sum level76 level2 level78)
(sum level76 level10 level86)
(sum level76 level11 level87)
(sum level76 level15 level91)
(sum level76 level16 level92)
(sum level76 level25 level101)
(sum level77 level2 level79)
(sum level77 level10 level87)
(sum level77 level11 level88)
(sum level77 level15 level92)
(sum level77 level16 level93)
(sum level77 level25 level102)
(sum level78 level2 level80)
(sum level78 level10 level88)
(sum level78 level11 level89)
(sum level78 level15 level93)
(sum level78 level16 level94)
(sum level78 level25 level103)
(sum level79 level2 level81)
(sum level79 level10 level89)
(sum level79 level11 level90)
(sum level79 level15 level94)
(sum level79 level16 level95)
(sum level79 level25 level104)
(sum level80 level2 level82)
(sum level80 level10 level90)
(sum level80 level11 level91)
(sum level80 level15 level95)
(sum level80 level16 level96)
(sum level80 level25 level105)
(sum level81 level2 level83)
(sum level81 level10 level91)
(sum level81 level11 level92)
(sum level81 level15 level96)
(sum level81 level16 level97)
(sum level81 level25 level106)
(sum level82 level2 level84)
(sum level82 level10 level92)
(sum level82 level11 level93)
(sum level82 level15 level97)
(sum level82 level16 level98)
(sum level82 level25 level107)
(sum level83 level2 level85)
(sum level83 level10 level93)
(sum level83 level11 level94)
(sum level83 level15 level98)
(sum level83 level16 level99)
(sum level83 level25 level108)
(sum level84 level2 level86)
(sum level84 level10 level94)
(sum level84 level11 level95)
(sum level84 level15 level99)
(sum level84 level16 level100)
(sum level84 level25 level109)
(sum level85 level2 level87)
(sum level85 level10 level95)
(sum level85 level11 level96)
(sum level85 level15 level100)
(sum level85 level16 level101)
(sum level85 level25 level110)
(sum level86 level2 level88)
(sum level86 level10 level96)
(sum level86 level11 level97)
(sum level86 level15 level101)
(sum level86 level16 level102)
(sum level86 level25 level111)
(sum level87 level2 level89)
(sum level87 level10 level97)
(sum level87 level11 level98)
(sum level87 level15 level102)
(sum level87 level16 level103)
(sum level87 level25 level112)
(sum level88 level2 level90)
(sum level88 level10 level98)
(sum level88 level11 level99)
(sum level88 level15 level103)
(sum level88 level16 level104)
(sum level88 level25 level113)
(sum level89 level2 level91)
(sum level89 level10 level99)
(sum level89 level11 level100)
(sum level89 level15 level104)
(sum level89 level16 level105)
(sum level89 level25 level114)
(sum level90 level2 level92)
(sum level90 level10 level100)
(sum level90 level11 level101)
(sum level90 level15 level105)
(sum level90 level16 level106)
(sum level90 level25 level115)
(sum level91 level2 level93)
(sum level91 level10 level101)
(sum level91 level11 level102)
(sum level91 level15 level106)
(sum level91 level16 level107)
(sum level91 level25 level116)
(sum level92 level2 level94)
(sum level92 level10 level102)
(sum level92 level11 level103)
(sum level92 level15 level107)
(sum level92 level16 level108)
(sum level92 level25 level117)
(sum level93 level2 level95)
(sum level93 level10 level103)
(sum level93 level11 level104)
(sum level93 level15 level108)
(sum level93 level16 level109)
(sum level93 level25 level118)
(sum level94 level2 level96)
(sum level94 level10 level104)
(sum level94 level11 level105)
(sum level94 level15 level109)
(sum level94 level16 level110)
(sum level94 level25 level119)
(sum level95 level2 level97)
(sum level95 level10 level105)
(sum level95 level11 level106)
(sum level95 level15 level110)
(sum level95 level16 level111)
(sum level95 level25 level120)
(sum level96 level2 level98)
(sum level96 level10 level106)
(sum level96 level11 level107)
(sum level96 level15 level111)
(sum level96 level16 level112)
(sum level96 level25 level121)
(sum level97 level2 level99)
(sum level97 level10 level107)
(sum level97 level11 level108)
(sum level97 level15 level112)
(sum level97 level16 level113)
(sum level97 level25 level122)
(sum level98 level2 level100)
(sum level98 level10 level108)
(sum level98 level11 level109)
(sum level98 level15 level113)
(sum level98 level16 level114)
(sum level98 level25 level123)
(sum level99 level2 level101)
(sum level99 level10 level109)
(sum level99 level11 level110)
(sum level99 level15 level114)
(sum level99 level16 level115)
(sum level99 level25 level124)
(sum level100 level2 level102)
(sum level100 level10 level110)
(sum level100 level11 level111)
(sum level100 level15 level115)
(sum level100 level16 level116)
(sum level100 level25 level125)
(sum level101 level2 level103)
(sum level101 level10 level111)
(sum level101 level11 level112)
(sum level101 level15 level116)
(sum level101 level16 level117)
(sum level101 level25 level126)
(sum level102 level2 level104)
(sum level102 level10 level112)
(sum level102 level11 level113)
(sum level102 level15 level117)
(sum level102 level16 level118)
(sum level102 level25 level127)
(sum level103 level2 level105)
(sum level103 level10 level113)
(sum level103 level11 level114)
(sum level103 level15 level118)
(sum level103 level16 level119)
(sum level103 level25 level128)
(sum level104 level2 level106)
(sum level104 level10 level114)
(sum level104 level11 level115)
(sum level104 level15 level119)
(sum level104 level16 level120)
(sum level104 level25 level129)
(sum level105 level2 level107)
(sum level105 level10 level115)
(sum level105 level11 level116)
(sum level105 level15 level120)
(sum level105 level16 level121)
(sum level105 level25 level130)
(sum level106 level2 level108)
(sum level106 level10 level116)
(sum level106 level11 level117)
(sum level106 level15 level121)
(sum level106 level16 level122)
(sum level106 level25 level131)
(sum level107 level2 level109)
(sum level107 level10 level117)
(sum level107 level11 level118)
(sum level107 level15 level122)
(sum level107 level16 level123)
(sum level107 level25 level132)
(sum level108 level2 level110)
(sum level108 level10 level118)
(sum level108 level11 level119)
(sum level108 level15 level123)
(sum level108 level16 level124)
(sum level108 level25 level133)
(sum level109 level2 level111)
(sum level109 level10 level119)
(sum level109 level11 level120)
(sum level109 level15 level124)
(sum level109 level16 level125)
(sum level109 level25 level134)
(sum level110 level2 level112)
(sum level110 level10 level120)
(sum level110 level11 level121)
(sum level110 level15 level125)
(sum level110 level16 level126)
(sum level110 level25 level135)
(sum level111 level2 level113)
(sum level111 level10 level121)
(sum level111 level11 level122)
(sum level111 level15 level126)
(sum level111 level16 level127)
(sum level111 level25 level136)
(sum level112 level2 level114)
(sum level112 level10 level122)
(sum level112 level11 level123)
(sum level112 level15 level127)
(sum level112 level16 level128)
(sum level112 level25 level137)
(sum level113 level2 level115)
(sum level113 level10 level123)
(sum level113 level11 level124)
(sum level113 level15 level128)
(sum level113 level16 level129)
(sum level113 level25 level138)
(sum level114 level2 level116)
(sum level114 level10 level124)
(sum level114 level11 level125)
(sum level114 level15 level129)
(sum level114 level16 level130)
(sum level114 level25 level139)
(sum level115 level2 level117)
(sum level115 level10 level125)
(sum level115 level11 level126)
(sum level115 level15 level130)
(sum level115 level16 level131)
(sum level115 level25 level140)
(sum level116 level2 level118)
(sum level116 level10 level126)
(sum level116 level11 level127)
(sum level116 level15 level131)
(sum level116 level16 level132)
(sum level117 level2 level119)
(sum level117 level10 level127)
(sum level117 level11 level128)
(sum level117 level15 level132)
(sum level117 level16 level133)
(sum level118 level2 level120)
(sum level118 level10 level128)
(sum level118 level11 level129)
(sum level118 level15 level133)
(sum level118 level16 level134)
(sum level119 level2 level121)
(sum level119 level10 level129)
(sum level119 level11 level130)
(sum level119 level15 level134)
(sum level119 level16 level135)
(sum level120 level2 level122)
(sum level120 level10 level130)
(sum level120 level11 level131)
(sum level120 level15 level135)
(sum level120 level16 level136)
(sum level121 level2 level123)
(sum level121 level10 level131)
(sum level121 level11 level132)
(sum level121 level15 level136)
(sum level121 level16 level137)
(sum level122 level2 level124)
(sum level122 level10 level132)
(sum level122 level11 level133)
(sum level122 level15 level137)
(sum level122 level16 level138)
(sum level123 level2 level125)
(sum level123 level10 level133)
(sum level123 level11 level134)
(sum level123 level15 level138)
(sum level123 level16 level139)
(sum level124 level2 level126)
(sum level124 level10 level134)
(sum level124 level11 level135)
(sum level124 level15 level139)
(sum level124 level16 level140)
(sum level125 level2 level127)
(sum level125 level10 level135)
(sum level125 level11 level136)
(sum level125 level15 level140)
(sum level126 level2 level128)
(sum level126 level10 level136)
(sum level126 level11 level137)
(sum level127 level2 level129)
(sum level127 level10 level137)
(sum level127 level11 level138)
(sum level128 level2 level130)
(sum level128 level10 level138)
(sum level128 level11 level139)
(sum level129 level2 level131)
(sum level129 level10 level139)
(sum level129 level11 level140)
(sum level130 level2 level132)
(sum level130 level10 level140)
(sum level131 level2 level133)
(sum level132 level2 level134)
(sum level133 level2 level135)
(sum level134 level2 level136)
(sum level135 level2 level137)
(sum level136 level2 level138)
(sum level137 level2 level139)
(sum level138 level2 level140)

(connected l0 l1)
(fuelcost level25 l0 l1)
(connected l0 l3)
(fuelcost level25 l0 l3)
(connected l0 l4)
(fuelcost level15 l0 l4)
(connected l0 l5)
(fuelcost level16 l0 l5)
(connected l1 l0)
(fuelcost level25 l1 l0)
(connected l1 l3)
(fuelcost level2 l1 l3)
(connected l1 l4)
(fuelcost level25 l1 l4)
(connected l2 l3)
(fuelcost level25 l2 l3)
(connected l2 l4)
(fuelcost level10 l2 l4)
(connected l3 l0)
(fuelcost level25 l3 l0)
(connected l3 l1)
(fuelcost level2 l3 l1)
(connected l3 l2)
(fuelcost level25 l3 l2)
(connected l3 l4)
(fuelcost level11 l3 l4)
(connected l4 l0)
(fuelcost level15 l4 l0)
(connected l4 l1)
(fuelcost level25 l4 l1)
(connected l4 l2)
(fuelcost level10 l4 l2)
(connected l4 l3)
(fuelcost level11 l4 l3)
(connected l5 l0)
(fuelcost level16 l5 l0)

(at t0 l1)
(fuel t0 level140)
(= (total-cost) 0)

(at p0 l4)
(at p1 l4)
(at p2 l1)
(at p3 l2)
(at p4 l1)
(at p5 l3)
(at p6 l0)
(at p7 l0)
(at p8 l4)
(at p9 l2)
(at p10 l5)
(at p11 l5)
)

(:goal
(and
(at p0 l5)
(at p1 l2)
(at p2 l2)
(at p3 l4)
(at p4 l3)
(at p5 l2)
(at p6 l5)
(at p7 l2)
(at p8 l0)
(at p9 l0)
(at p10 l1)
(at p11 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 0 of 12
2. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 12
3. (drive t0 l1 l3 level138 level2 level140)
   deleted: (at t0 l1) (fuel t0 level140)
   added: (at t0 l3) (fuel t0 level138)
   goals met: 0 of 12
4. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 1 of 12
5. (load p5 t0 l3)
   deleted: (at p5 l3)
   added: (in p5 t0)
   goals met: 1 of 12
6. (drive t0 l3 l2 level113 level25 level138)
   deleted: (at t0 l3) (fuel t0 level138)
   added: (at t0 l2) (fuel t0 level113)
   goals met: 1 of 12
7. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 2 of 12
8. (load p9 t0 l2)
   deleted: (at p9 l2)
   added: (in p9 t0)
   goals met: 2 of 12
9. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 2 of 12
10. (drive t0 l2 l4 level103 level10 level113)
   deleted: (at t0 l2) (fuel t0 level113)
   added: (at t0 l4) (fuel t0 level103)
   goals met: 2 of 12
11. (unload p3 t0 l4)
   deleted: (in p3 t0)
   added: (at p3 l4)
   goals met: 3 of 12
12. (load p8 t0 l4)
   deleted: (at p8 l4)
   added: (in p8 t0)
   goals met: 3 of 12
13. (load p1 t0 l4)
   deleted: (at p1 l4)
   added: (in p1 t0)
   goals met: 3 of 12
14. (load p0 t0 l4)
   deleted: (at p0 l4)
   added: (in p0 t0)
   goals met: 3 of 12
15. (drive t0 l4 l0 level88 level15 level103)
   deleted: (at t0 l4) (fuel t0 level103)
   added: (at t0 l0) (fuel t0 level88)
   goals met: 3 of 12
16. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 3 of 12
17. (drive t0 l0 l5 level72 level16 level88)
   deleted: (at t0 l0) (fuel t0 level88)
   added: (at t0 l5) (fuel t0 level72)
   goals met: 3 of 12
18. (load p10 t0 l5)
   deleted: (at p10 l5)
   added: (in p10 t0)
   goals met: 3 of 12
19. (load p11 t0 l5)
   deleted: (at p11 l5)
   added: (in p11 t0)
   goals met: 3 of 12
20. (unload p0 t0 l5)
   deleted: (in p0 t0)
   added: (at p0 l5)
   goals met: 4 of 12
21. (unload p6 t0 l5)
   deleted: (in p6 t0)
   added: (at p6 l5)
   goals met: 5 of 12
22. (drive t0 l5 l0 level56 level16 level72)
   deleted: (at t0 l5) (fuel t0 level72)
   added: (at t0 l0) (fuel t0 level56)
   goals met: 5 of 12
23. (load p7 t0 l0)
   deleted: (at p7 l0)
   added: (in p7 t0)
   goals met: 5 of 12
24. (unload p8 t0 l0)
   deleted: (in p8 t0)
   added: (at p8 l0)
   goals met: 6 of 12
25. (unload p9 t0 l0)
   deleted: (in p9 t0)
   added: (at p9 l0)
   goals met: 7 of 12
26. (drive t0 l0 l1 level31 level25 level56)
   deleted: (at t0 l0) (fuel t0 level56)
   added: (at t0 l1) (fuel t0 level31)
   goals met: 7 of 12
27. (unload p10 t0 l1)
   deleted: (in p10 t0)
   added: (at p10 l1)
   goals met: 8 of 12
28. (drive t0 l1 l3 level29 level2 level31)
   deleted: (at t0 l1) (fuel t0 level31)
   added: (at t0 l3) (fuel t0 level29)
   goals met: 8 of 12
29. (unload p11 t0 l3)
   deleted: (in p11 t0)
   added: (at p11 l3)
   goals met: 9 of 12
30. (drive t0 l3 l2 level4 level25 level29)
   deleted: (at t0 l3) (fuel t0 level29)
   added: (at t0 l2) (fuel t0 level4)
   goals met: 9 of 12
31. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 10 of 12
32. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 11 of 12
33. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 12 of 12
